# Создать словарь , в котором будет храниться 1 производитель компьютеров и список выпускаемых
# моделей (МИНИМУМ 3). Любым известным способом добавить еще как
# минимум 3 марки и список моделей к каждой из них.
# Вывести в консоль поочередно : марка – первая модель из списка


manuf = {
    'grundic': ['Model A', 'Flatron', 'Dakota']
}

manuf['Microsoft'] = ['Xbox', 'X360', 'Xone']
manuf['Sony'] = ['PSX', 'PS2', 'PS5']
manuf['Nintendo'] = ['Wii', 'NSw', '3ds']

print(manuf)
