# Даны 2 действительных числа a и b. Получить их сумму, разность и
# произведение.


a = 3
b = 2

print(a+b)
print(a-b)
print(a*b)