# Даны действительные числа x и y. Получить 1+ |xy|/|x| − |y|


x = 3
y = 2

print((x-y)/(1+x*y))