# Даны два действительных числа. Найти среднее арифметическое и
# среднее геометрическое этих чисел

# Мат. формула среднего арифметического (a+b)/2)
# Мат. формула среднего геометрического √a*b
# Что бы это посчитать, будем использовать модуль math


import math

a = 5
b = 6

print((a + b) / 2)
print(math.sqrt(a * b))
