# Дана длина ребра куба, допустим она равна 7
# Далее ищем sb (площадь боковой поверхности)
# Далее ищем v (обьем куба)
l = 7
print(l*4)

sb = 28
print(sb*6)

#Исходя из первого действия площадь боковой поверхности равна 28
#Исходя из второго действия обьем куба равен 168