# Даны два кортежа:
# C_1 = (35, 78, 21, 37, 2, 98, 6, 100, 231)
# C_2 = (45, 21, 124, 76, 5, 23, 91, 234)
# Необходимо определить:
# 1) Сумма элементов какого из кортежей больше и вывести соответствующее
# сообщение на экран (Сумма больше в кортеже - ..)
# 2) Вывести на экран порядковые номера минимальных и максимальных элементов
# этих кортежей

c1 = (35, 35, 78, 21, 37, 2, 98, 6, 100, 231,)
c2 = (45, 21, 124, 76, 5, 23, 91, 234,)
#
s1 = sum(c1)
s2 = sum(c2)
print('1 tuple', s1)
print('2 tuple', s2)

if s1 > s2:
    print('1 is bigger')
else:
    print('2 is bigger')

print('min 1', c1.index(min(c1)))
print('min 2', c2.index(min(c2)))
print('max 1', c1.index(max(c1)))
print('max 2', c2.index(max(c2)))
